app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-02-08 18:12:01.381452"], ["updated_at", "2019-02-08 18:12:01.381452"]]
---
  def create
    @student  = Student.new(params.require(:student))
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-02-08 18:34:38.404899"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(params.require[:student])